/*
 *  변수 / 배열 ==> 데이터를 저장하는 용도
 *  
 *  	일반변수: 사용자가 입력할 때 저장
 *  		명시적 초기화: 임의로 결정
 *  		입력값을 받는 경우: Scanner
 *  		난수
 *  		파일읽기
 *  		크롤링
 *  	루프변수: i,j
 *  	누적변수: sum => sum += i
 *  	갯수변수: count => count++
 *  
 *  	배열: 데이터가 많은경우
 *  		 같은 유형의 데이터가 3개 이상
 *  
 *  어떤 데이터를 저장
 *  	데이터형: int, long, double, String, boolean
 *  
 *  ---------------------데이터 저장 방법 -----------------------
 *  
 *  
 *  
 *  
 *  데이터 가공: 연산자/제어문
 *  
 *  연산자
 *  	증감연산자 (++,--) / 부정연산자 (!) => 주로 조건문을 만들때
 *  	  |->1개 증가 1개 감소
 *  	형변환 연산자 => double -> int  / 클래스 형변환(라이브러리 사용이 가능)
 *  	  |-> 자동 형변환(제네릭)
 *  	산술연산자 : 통계 => 장바구니 / 결제 금액 => 단독으로 사용
 *  		+,*,/,-,%
 *  	비교연산자 / 논리연산자 => 조건문 만들때 주로 사용
 *  		==,!=,<,>,<=,>=, &&,||
 *  		&&=> 포함  ||=> 포함이 안된경우
 *  	대입연산자 = 결과값을 받아서 브라우저로 전송
 *  		+=,-=
 *  
 *  제어문
 *  	조건문 : 검색, 아이디와 비밀번호 찾기
 *  		if(조건문)
 *  		{
 *  			검색
 *  		}
 *  		
 *  		if(조건)
 *  		{
 *  		}
 *  		else
 *  		{
 *  		}
 *  
 *  		if(조건)
 *  		{
 *  		}
 *  		else if(조건)
 *  		{
 *  		}
 *  		....
 *  		else
 *  		{
 *  		}
 *  	다중 조건문 switc
 *  	반복문
 *  		for문 (화면,UI,목록,이미지 슬라이싱)
 *  		while문 (데이터베이스,파일 읽기)
 *  	반복제어문
 *  		break : back-end에서 사용, 데이터가 많은 경우 
 *  
 *  	--> 크롤링 (데이터 수집)
 *  		.title class     #title  id
 *  	--> 페이징 기법 ( *필수* ) : 인라인뷰 / Limit
 *  
 */
import java.util.*;
public class 형식_사용처정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
	
	}

}
