/*
 * 	메소드 사용
 * 	
 * 		1. 중복 제거 기능
 * 		2. 소스의 간결화 -> 
 * 			-구조적인 프로그램
 * 			-코드 관리가 편리
 * 		3. 수정이나 추가가 가능
 * 		4. 재사용이 가능
 * 			-필요시에 다른 클래스에서 연결 
 * 
 * 	=> 제작 => 호출 => 결과값 => 화면 연결
 * 
 * 		리턴형 메소드   -> 선언부
 * 		{			-> 구현부 {}를 해야 메모리에 저장
 * 		}
 * 
 * 		-> Call Stack영역을 가지고 있다
 * 				----- LIFO 형식
 * 			-> 메소드를 종료해야 다른 메소드 호출이 가능
 * 
 * 	1) 리턴형 : 데이터형(정수, 실수, 문자, 문자열, 논리형), 배열
 *  2) 매개변수 :  데이터형(정수, 실수, 문자, 문자열, 논리형), 배열
 *  3) 메소드명 : 알파벳,한글 (길이 제한은 없지만 보통 7~10자)
 *  			숫자사용이 가능하지만 앞에 올 수 없다
 *  			키워드 사용 불가능
 *  			특수문자는 _, $만 사용가능(_는 임시 및 테스트일때 많이 사용)
 *  			공백포함 불가능
 *  4) 같은 클래스에서는 같은 메소드명 사용 불가
 *  	=> 예외사항: 이름은 같지만 매개변수의 갯수나 데이터형이 다른경우 다른 베소드로 인식(오버로딩)
 *  5) 모든 프로그램에 기본 메소드
 *  	1. 입력
 *  	2. 처리
 *  	3. 출력
 *  
 *  리턴형이 여러개
 *  ----- 결과값이 여러개 => 데이터형[]
 *  ----- 검색 후 검색된 결과
 *  
 *  매개변수가 여러개
 *  ----- 메소드명(데이터형[])
 *  ----- 메소드명(object ...arg) / 가변 매개변수
 *  
 *  
 */
public class 메소드_5 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
	}

}
